Hiemenz/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//dynamicFvMesh   dynamicRefineFvMesh;
dynamicFvMesh   staticFvMesh;

// How often to refine
refineInterval  25;

// Field to be refinement on
field           alpha.water;

// Refine field inbetween lower..upper
lowerRefineLevel 0.01;
upperRefineLevel 0.99;

// If value < unrefineLevel unrefine
unrefineLevel  10;

// Have slower than 2:1 refinement
nBufferLayers   1;//1;

// Refine cells only up to maxRefinement levels
maxRefinement   1;//2;

// Stop refinement if maxCells reached
maxCells        1000000;

// Flux field and corresponding velocity field. Fluxes on changed
// faces get recalculated by interpolating the velocity. Use 'none'
// on surfaceScalarFields that do not need to be reinterpolated.
correctFluxes
(
    (phi none)
    (nHatf none)
    (rhoPhi none)
    (alphaPhi_ none)
    (ghf none)
    (phi0 none)
    (dVf_ none)
   
    //(interfaceCentre.water interpolate)
    
    (deltaFunction_ none)
    (talphaPhiCorr0_ none)
    (Kf_ none)
    (nHatf_ none)
);

// Write the refinement level as a volScalarField
dumpLevel       true;


// ************************************************************************* //
