Hiemenz/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

water
{
    transportModel  Newtonian;
    nu              1.116e-7;//1e-6;//1e-6;//
    rho             8960;//1000;
}

air
{
    transportModel  Newtonian;
    nu              1e-6;//1.48e-05;
    rho             1000;//1;
}

Ucell		    0.3; //Volts

sigma               0;//1e-6;//0.07;

j0		    10;//-0.05; //mdot [ 1 -3 -1 0 0 0 0 ]

species		    true;//false;//

fluid		    true;//false;//

uin		    -2e-4;

C0		    100;

D		    5e-10;

beta_c		    0;//1e-3;// densification coefficient * C0

kf_s		5;//1000;//3;//10;// // S/m == A/V/m == A^2s^3/kg/m^3  // dimensions [-1 -3 3 0 0 2 0]
kf_f		10; // S/m == A/V/m == A^2s^3/kg/m^3  // dimensions [-1 -3 3 0 0 2 0]

bc		-0.05133;//-0.025666;//
ba		0.01711;//0.025666;//

ne		2;

MW		0.06354;//

Sct             0.5; //Sct [ 0 0 0 0 0 0 0 ]

surfaceForces
{
  sigma 0;//1e-6;//0.07;
  surfaceTensionForceModel RDF;//gradAlpha;//heightFunction;//gradAlpha;//( constantCurvature fitParaboloid gradAlpha )
  //curv a;//10
  accelerationForceModel gravity;
  deltaFunctionModel alphaCSF;
}

// ************************************************************************* //
