Hiemenz/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../constant/transportProperties"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "(wall_cathode)"//"(wall_cathode|inlet)"
    {
        type    noSlip;
    }
    
    "(inlet|outlet)"
    {
        type    zeroGradient;//inletOutlet;//
        //inletValue	uniform (0 0 0);
        //value	uniform (0 0 0);
    }
    
    wall_anode
    {
        type    fixedValue;
        value	uniform (0 $uin 0);//
    }
   
    #include "include/constantPatches"
}


// ************************************************************************* //
