Hiemenz/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(wall_anode|wall_cathode)"
    {
        type    zeroGradient;//fixedFluxPressure;
        //value   uniform 0;
    }
    
    "(inlet|outlet)"
    {
        type    fixedValue;//fixedFluxPressure;//
        value	uniform 0;//
    }
    
    #include "include/constantPatches"
}

// ************************************************************************* //
