Hiemenz/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    //volScalarFieldValue alpha.vapour 0 //0
    volScalarFieldValue alpha.water 0 //0
);

regions
(
    /*cylinderToCell
    {
	p1 (0.25 0.25 -1);
	p2 (0.25 0.25 1);
	radius 0.02;

        fieldValues
        (
            volScalarFieldValue alpha.vapour 1
        );
    }*/
    
    boxToCell
    {
	box (-100 -100 -100)(100 0 100);
	
        fieldValues
        (
            //volScalarFieldValue alpha.vapour 1 //1
            volScalarFieldValue alpha.water 1 //0
        );
    } 
);

// ************************************************************************* //
